Ran Plan for 8 projects:

1. dir: `terragrunt/production/vpc-networks/static-ip-awx` workspace: `default`
1. dir: `terragrunt/production/vpc-networks/static-ip-jenkins-agent-fire` workspace: `default`
1. dir: `terragrunt/production/vpc-networks/static-ip-jenkins-agent-sandbox` workspace: `default`
1. dir: `terragrunt/production/vpc-networks/static-ip-jenkins` workspace: `default`
1. dir: `terragrunt/production/vpc-networks/static-ip-mariadb` workspace: `default`
1. dir: `terragrunt/production/vpc-networks` workspace: `default`
1. dir: `terragrunt/staging/vpc-networks/static-ip-mariadb` workspace: `default`
1. dir: `terragrunt/staging/vpc-networks` workspace: `default`

### 1. dir: `terragrunt/production/vpc-networks/static-ip-awx` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T03:10:19Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-awx] 
time=2023-12-17T03:10:19Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-awx] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_address.static_ip will be created
  + resource "google_compute_address" "static_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "static-ip-awx"
      + network_tier       = (known after apply)
      + prefix_length      = (known after apply)
      + project            = "fundhub-408000"
      + purpose            = (known after apply)
      + region             = "asia-southeast2"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + terraform_labels   = (known after apply)
      + users              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-awx/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-awx/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/production/vpc-networks/static-ip-awx`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fproduction%252Fvpc-networks%252Fstatic-ip-awx%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/production/vpc-networks/static-ip-awx`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `terragrunt/production/vpc-networks/static-ip-jenkins-agent-fire` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T03:10:25Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-jenkins-agent-fire] 
time=2023-12-17T03:10:25Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-jenkins-agent-fire] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_address.static_ip will be created
  + resource "google_compute_address" "static_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "static-ip-jenkins-agent-fire"
      + network_tier       = (known after apply)
      + prefix_length      = (known after apply)
      + project            = "fundhub-408000"
      + purpose            = (known after apply)
      + region             = "asia-southeast2"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + terraform_labels   = (known after apply)
      + users              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-jenkins-agent-fire/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-jenkins-agent-fire/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/production/vpc-networks/static-ip-jenkins-agent-fire`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fproduction%252Fvpc-networks%252Fstatic-ip-jenkins-agent-fire%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/production/vpc-networks/static-ip-jenkins-agent-fire`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 3. dir: `terragrunt/production/vpc-networks/static-ip-jenkins-agent-sandbox` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T03:10:30Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-jenkins-agent-sandbox] 
time=2023-12-17T03:10:30Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-jenkins-agent-sandbox] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_address.static_ip will be created
  + resource "google_compute_address" "static_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "static-ip-jenkins-agent-sandbox"
      + network_tier       = (known after apply)
      + prefix_length      = (known after apply)
      + project            = "fundhub-408000"
      + purpose            = (known after apply)
      + region             = "asia-southeast2"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + terraform_labels   = (known after apply)
      + users              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-jenkins-agent-sandbox/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-jenkins-agent-sandbox/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/production/vpc-networks/static-ip-jenkins-agent-sandbox`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fproduction%252Fvpc-networks%252Fstatic-ip-jenkins-agent-sandbox%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/production/vpc-networks/static-ip-jenkins-agent-sandbox`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 4. dir: `terragrunt/production/vpc-networks/static-ip-jenkins` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T03:10:35Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-jenkins] 
time=2023-12-17T03:10:35Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-jenkins] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_address.static_ip will be created
  + resource "google_compute_address" "static_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "static-ip-jenkins"
      + network_tier       = (known after apply)
      + prefix_length      = (known after apply)
      + project            = "fundhub-408000"
      + purpose            = (known after apply)
      + region             = "asia-southeast2"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + terraform_labels   = (known after apply)
      + users              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-jenkins/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-jenkins/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/production/vpc-networks/static-ip-jenkins`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fproduction%252Fvpc-networks%252Fstatic-ip-jenkins%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/production/vpc-networks/static-ip-jenkins`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 5. dir: `terragrunt/production/vpc-networks/static-ip-mariadb` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T03:10:40Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-mariadb] 
time=2023-12-17T03:10:40Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-mariadb] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_address.static_ip will be created
  + resource "google_compute_address" "static_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "static-ip-mariadb"
      + network_tier       = (known after apply)
      + prefix_length      = (known after apply)
      + project            = "fundhub-408000"
      + purpose            = (known after apply)
      + region             = "asia-southeast2"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + terraform_labels   = (known after apply)
      + users              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-mariadb/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks/static-ip-mariadb/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/production/vpc-networks/static-ip-mariadb`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fproduction%252Fvpc-networks%252Fstatic-ip-mariadb%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/production/vpc-networks/static-ip-mariadb`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 6. dir: `terragrunt/production/vpc-networks` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks": exit status 1: running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks": 
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

Error: No configuration files

Plan requires configuration to be present. Planning without a configuration
would mark everything for destruction, which is normally not what is desired.
If you would like to destroy everything, run plan with the -destroy option.
Otherwise, create a Terraform configuration file (.tf file) and try again.
time=2023-12-17T03:10:46Z level=error msg=terraform invocation failed in /root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks
time=2023-12-17T03:10:46Z level=error msg=1 error occurred:
	* [/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/production/vpc-networks] exit status 1



time=2023-12-17T03:10:45Z level=warning msg=The following inputs passed in by terragrunt are unused:

time=2023-12-17T03:10:45Z level=warning msg=	- credentials
time=2023-12-17T03:10:45Z level=warning msg=	- name
time=2023-12-17T03:10:45Z level=warning msg=	- project_id
time=2023-12-17T03:10:45Z level=warning msg=	- region
time=2023-12-17T03:10:45Z level=warning msg=	- zone
time=2023-12-17T03:10:45Z level=warning msg=	- address_type
time=2023-12-17T03:10:45Z level=warning
time=2023-12-17T03:10:45Z level=info msg=All required inputs are passed in by terragrunt
time=2023-12-17T03:10:45Z level=warning msg=Terragrunt configuration has misaligned inputs, but running in relaxed mode so ignoring.

```
</details>

---
### 7. dir: `terragrunt/staging/vpc-networks/static-ip-mariadb` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T03:10:47Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/staging/vpc-networks/static-ip-mariadb] 
time=2023-12-17T03:10:47Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/staging/vpc-networks/static-ip-mariadb] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_address.static_ip will be created
  + resource "google_compute_address" "static_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "static-ip-mariadb"
      + network_tier       = (known after apply)
      + prefix_length      = (known after apply)
      + project            = "fundhub-staging"
      + purpose            = (known after apply)
      + region             = "asia-southeast2"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + terraform_labels   = (known after apply)
      + users              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/staging/vpc-networks/static-ip-mariadb/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/staging/vpc-networks/static-ip-mariadb/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/staging/vpc-networks/static-ip-mariadb`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fstaging%252Fvpc-networks%252Fstatic-ip-mariadb%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/staging/vpc-networks/static-ip-mariadb`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 8. dir: `terragrunt/staging/vpc-networks` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/staging/vpc-networks": exit status 1: running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/staging/vpc-networks": 
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

Error: No configuration files

Plan requires configuration to be present. Planning without a configuration
would mark everything for destruction, which is normally not what is desired.
If you would like to destroy everything, run plan with the -destroy option.
Otherwise, create a Terraform configuration file (.tf file) and try again.
time=2023-12-17T03:10:53Z level=error msg=terraform invocation failed in /root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/staging/vpc-networks
time=2023-12-17T03:10:53Z level=error msg=1 error occurred:
	* [/root/.atlantis/repos/titan2903/fundhub-terraform-config/1/default/terragrunt/staging/vpc-networks] exit status 1



time=2023-12-17T03:10:52Z level=warning msg=The following inputs passed in by terragrunt are unused:

time=2023-12-17T03:10:52Z level=warning msg=	- region
time=2023-12-17T03:10:52Z level=warning msg=	- zone
time=2023-12-17T03:10:52Z level=warning msg=	- address_type
time=2023-12-17T03:10:52Z level=warning msg=	- credentials
time=2023-12-17T03:10:52Z level=warning msg=	- name
time=2023-12-17T03:10:52Z level=warning msg=	- project_id
time=2023-12-17T03:10:52Z level=warning
time=2023-12-17T03:10:52Z level=info msg=All required inputs are passed in by terragrunt
time=2023-12-17T03:10:52Z level=warning msg=Terragrunt configuration has misaligned inputs, but running in relaxed mode so ignoring.

```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`